export default {

    /**
     * hash-sha1值
     */
    sha1: /^[0-9a-zA-Z]{40}$/,

    /**
     * 插件命名规则
     */
    widgetName: /^freelog-[a-z0-9._-]{3,15}-[a-z0-9._-]{2,14}[a-z0-9]{1}$/,

    /**
     * md5
     */
    md5: /^[0-9a-f]{32}$/,

    /**
     * +86 地区移动手机号码
     */
    mobile86: /^1[34578]\d{9}$/,

    /**
     * email
     */
    email: /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*@([A-Za-z\d]+[-.])+[A-Za-z\d]{2,4}$/,

    /**
     * mongodb-object-id
     */
    mongoObjectId: /^[0-9a-f]{24}$/,

    /**
     * 逗号分隔的sha1
     */
    splitSha1: /^[0-9a-zA-Z]{40}(,[0-9a-zA-Z]{40})*$/,

    /**
     * 逗号分隔的mongodbObjectId
     */
    splitMongoObjectId: /^[0-9a-f]{24}(,[0-9a-f]{24})*$/,

    /**
     * 逗号分隔的md5
     */
    splitMd5: /^[0-9a-f]{32}(,[0-9a-f]{32})*$/,

    /**
     * 逗号分隔的数字
     */
    splitNumber: /^\d+(,\d+)*$/,

    /**
     * 资源类型校验
     */
    resourceType: /^(?!_)[a-z0-9_]{3,20}(?<!_)$/,

    /**
     * 节点短域名
     */
    nodeDomain: /^(?!-)[a-z0-9-]{4,24}(?<!-)$/,

    /**
     * 节点名称(中文,英文,数字)
     */
    nodeName: /^[\u4E00-\u9FA5|a-zA-Z0-9]{2,24}$/,

    /**
     * 32位小写16进制
     */
    bit32Hex: /^[0-9a-f]{32}$/,

    /**
     * 交易账户ID
     */
    transferAccountId: /^(feth|fcny|fusd|feur)\d{3}[a-f0-9]{8}$/,

    /**
     * bucketName规则:只允许小写字母、数字、中划线（-），且不能以短横线开头或结尾.
     */
    bucketName: /^((?!-)[a-z0-9-]{1,63}(?<!-)$)|(.UserNodeData)/, /// ^(?!-)[\.]?[a-z0-9-]{1,63}(?<!-)$/,

    /**
     * 严格模式的bucketName,只允许小写字母、数字、中划线（-），且不能以短横线开头或结尾
     */
    strictBucketName: /^(?!-)[a-z0-9-]{1,63}(?<!-)$/,

    /**
     * 字母、数字、中划线（-）组成,且不能以短横线开头或结尾,1-30长度
     */
    username: /^(?!-)[A-Za-z0-9-]{1,30}(?<!-)$/,

    /**
     * 同commonNameFormat
     */
    resourceName: /^(?!.*(\\|\/|:|\*|\?|"|<|>|\||\s|@|\$|#)).{1,60}$/,

    /**
     * 密码格式,6-24位任意字符,组合中必须包含数字和字母
     */
    password: /^(?=.*[0-9])(?=.*[a-zA-Z])(.{6,24})$/,

    /**
     * 发行全名规则,由username/resourceName组合而成
     */
    fullResourceName: /^(?!-)[A-Za-z0-9-]{1,30}(?<!-)\/(?!.*(\\|\/|:|\*|\?|"|<|>|\||\s|@|\$|#)).{1,60}$/,

    /**
     * 通用名称命名规则,(资源,mock,presentable统一)名称(不能包含\ / : * ? " < > |字符以及空格,长度1-60)
     */
    commonNameFormat: /^(?!.*(\\|\/|:|\*|\?|"|<|>|\||\s|@|\$|#)).{1,60}$/,

    /**
     * 排序格式, 正序 fieldName:1 或者 倒序 fieldName:-1
     */
    pageSortString: /[a-zA-Z0-9_]{1,20}:(1|-1)/,

    /**
     * freelog 用户ID
     */
    userId: /^[0-9]{5,12}$/,

    /**
     * 逗号分隔的用户ID
     */
    splitUserIds: /^[0-9]{5,12}(,[0-9]{5,12})*$/,
};
